Repository: jhkrug/kubewarden-product-docs
Catalog: po/*.po
Languages: es

source: What is {project-name}?
es: ¿Qué es {project-name}?

source: {project-name} is a Kubernetes Policy Engine. It aims to be the Universal Policy Engine for Kubernetes.
es: {project-name} es un motor de políticas de Kubernetes. Su objetivo es ser el motor de políticas universal para Kubernetes.

source: Now here is a link into rancher-product-docs Overview:
es: A continuación, un enlace a la descripción general de la documentación del producto Rancher:

source: xref:rancher-manager:en:/about-rancher/overview.adoc[Overview]
es: xref:rancher-manager:es:/about-rancher/overview.adoc[Resumen]

source: How does {project-name} help?
es: ¿Cómo ayuda {project-name}?

source: {short-project-name} offers flexibility for policy admission and enforcement in a Kubernetes environment.
es: {short-project-name} ofrece flexibilidad para la admisión y aplicación de políticas en un entorno de Kubernetes.

source: Benefits and value
es: Beneficios y valor

source: Use any programming language that generates https://webassembly.org[WebAssembly] binaries to write your policies.
es: Use cualquier lenguaje de programación que genere binarios de https://webassembly.org[WebAssembly] para escribir sus políticas.

source: WebAssembly enables policy compatibility across processors and operating systems.
es: WebAssembly permite la compatibilidad de políticas entre procesadores y sistemas operativos.

source: Reuse of policies from other policy engines without the need for rewriting them.
es: Reutilización de políticas de otros motores de políticas sin necesidad de reescribirlas.

source: Distribute policies using standard and secure mechanisms such as https://opencontainers.org[OCI] compliant registries.
es: Distribuya políticas utilizando mecanismos estándar y seguros, como los registros compatibles con https://opencontainers.org[OCI].

source: Policy enforcement at admission ensures only compliant workloads run.
es: La aplicación de políticas en la admisión garantiza que solo se ejecuten cargas de trabajo conformes.

source: The {short-project-name} audit scanner actively and continuously checks policy enforcement over time.
es: El escáner de auditoría de {short-project-name} comprueba activa y continuamente la aplicación de las políticas a lo largo del tiempo.

source: Verify policies using https://slsa.dev[SLSA] (Supply Chain Levels for Software Artifacts) tools and practices.
es: Verifique las políticas utilizando las herramientas y prácticas de https://slsa.dev[SLSA] (Supply Chain Levels for Software Artifacts).

source: {project-name} provides a comprehensive approach to admission policy management.
es: {project-name} proporciona un enfoque integral para la gestión de políticas de admisión.

source: CNCF membership and a growing open source community and ecosystem help {short-project-name} with transparency, collaboration and improvement.
es: La pertenencia a la CNCF y una comunidad y un ecosistema de código abierto en crecimiento ayudan a {short-project-name} con la transparencia, la colaboración y la mejora.

source: Use cases
es: Casos de uso

source: Security hardening. For example, enforce policies restricting container privileges, enforce network policies, or block insecure image registries.
es: Refuerzo de la seguridad. Por ejemplo, aplicar políticas que restrinjan los privilegios de los contenedores, aplicar políticas de red o bloquear los registros de imágenes no seguros.

source: Compliance auditing. Ensure workloads comply with organizational or regulatory standards and best practices.
es: Auditoría de cumplimiento. Garantizar que las cargas de trabajo cumplen las normas y mejores prácticas organizativas o reglamentarias.

source: Resource optimization. Enforce resource limits and quotas.
es: Optimización de recursos. Aplicar límites y cuotas de recursos.

source: There is further documentation of use cases on the xref:use-cases.adoc[use cases] page.
es: Hay más documentación sobre casos de uso en la página xref:use-cases.adoc[casos de uso].

source: New to {short-project-name}?
es: ¿Es nuevo en {short-project-name}?

source: If new to the {short-project-name} project start with the xref:quick-start.adoc[Quick start guide] and the xref:explanations/architecture.adoc[architecture] page. Then it depends where your interests take you. For policy developers there are language specific sections in the tutorials. For integrators and administrators there is a 'how-tos' section. The explanations section contains useful background material. There is also a xref:glossary.adoc[glossary].
es: Si es nuevo en el proyecto {short-project-name}, empiece con la xref:quick-start.adoc[guía de inicio rápido] y la página de xref:explanations/architecture.adoc[arquitectura]. A partir de ahí, dependerá de sus intereses. Para los desarrolladores de políticas, hay secciones específicas de cada lenguaje en los tutoriales. Para los integradores y administradores, hay una sección de 'guías prácticas'. La sección de explicaciones contiene material de fondo útil. También hay un xref:glossary.adoc[glosario].

source: What is WebAssembly?
es: ¿Qué es WebAssembly?

source: As stated on https://webassembly.org/[WebAssembly's official website]:
es: Como se indica en el https://webassembly.org/[sitio web oficial de WebAssembly]:

source: WebAssembly (abbreviated Wasm) is a binary instruction format for a stack-based virtual machine. Wasm is designed as a portable compilation target for programming languages, enabling deployment on the web for client and server applications.
es: WebAssembly (abreviado Wasm) es un formato de instrucción binario para una máquina virtual basada en pila. Wasm está diseñado como un destino de compilación portátil para lenguajes de programación, lo que permite su despliegue en la web para aplicaciones de cliente y servidor.

source: Wasm was originally conceived as a browser "extension". However, the WebAssembly community is engaged in efforts to allow the execution of Wasm code outside browsers.
es: Wasm se concibió originalmente como una "extensión" del navegador. Sin embargo, la comunidad de WebAssembly está trabajando para permitir la ejecución de código Wasm fuera de los navegadores.

source: Why use WebAssembly?
es: ¿Por qué usar WebAssembly?

source: Users can write Kubernetes policies using their favorite programming language, provided its toolchain can generate Wasm binaries.
es: Los usuarios pueden escribir políticas de Kubernetes utilizando su lenguaje de programación favorito, siempre que su cadena de herramientas pueda generar binarios Wasm.

source: Wasm modules are portable, once built they can run on any kind of processor architecture and operating system. For example, a policy developed and built on Apple Silicon can run on AMD64/Intel64 Linux without conversion.
es: Los módulos Wasm son portátiles, una vez construidos pueden ejecutarse en cualquier tipo de arquitectura de procesador y sistema operativo. Por ejemplo, una política desarrollada y construida en Apple Silicon puede ejecutarse en AMD64/Intel64 Linux sin conversión.

source: Policy authors can reuse their skills, tools and best practices. Policies are "traditional" programs that can have reusable blocks (regular libraries). You can lint and test them and you can plug them into current CI and CD workflows.
es: Los autores de políticas pueden reutilizar sus habilidades, herramientas y mejores prácticas. Las políticas son programas "tradicionales" que pueden tener bloques reutilizables (bibliotecas regulares). Puede hacer linting y probarlas y puede conectarlas a los flujos de trabajo de CI y CD actuales.

source: Policy distribution
es: Distribución de políticas

source: You can serve {short-project-name} policies using a standard web server or, better, you can publish them in an OCI compliant registry as https://github.com/opencontainers/artifacts[OCI artifacts].
es: Puede servir las políticas de {short-project-name} utilizando un servidor web estándar o, mejor aún, puede publicarlas en un registro compatible con OCI como https://github.com/opencontainers/artifacts[artefactos OCI].

source: Vendor neutrality
es: Neutralidad del proveedor

source: {short-project-name} is a link:https://contribute.cncf.io/maintainers/community/vendor-neutrality/[vendor neutral] project as defined by the CNCF.
es: {short-project-name} es un proyecto link:https://contribute.cncf.io/maintainers/community/vendor-neutrality/[neutral con respecto a los proveedores] tal y como lo define la CNCF.

source: Quick start
es: Inicio rápido

source: The {project-name} stack comprises:
es: La pila de {project-name} se compone de:

source: One or more {cluster-admission-policy} resources: this defines policies for Kubernetes clusters.
es: Uno o más recursos {cluster-admission-policy}: esto define las políticas para los clústeres de Kubernetes.

source: One or more {policy-server} resources: representing a deployment of a {short-project-name} `PolicyServer`. The {short-project-name} `PolicyServer` loads and evaluates your administrator's policies.
es: Uno o más recursos {policy-server}: que representan un despliegue de un `PolicyServer` de {short-project-name}. El `PolicyServer` de {short-project-name} carga y evalúa las políticas de su administrador.

source: One or more {admission-policy} resources: policies for a defined namespace.
es: Uno o más recursos {admission-policy}: políticas para un espacio de nombres definido.

source: A deployment of a `kubewarden-controller`: this controller monitors the {cluster-admission-policy} resources and interacts with the {short-project-name} {policy-server} components.
es: Un despliegue de un `kubewarden-controller`: este controlador supervisa los recursos {cluster-admission-policy} e interactúa con los componentes {policy-server} de {short-project-name}.

source: {short-project-name} describes its Kubernetes Custom Resource Definitions (CRDs) xref:reference/CRDs.adoc[here].
es: {short-project-name} describe sus Definiciones de Recursos Personalizados (CRD) de Kubernetes xref:reference/CRDs.adoc[aquí].

source: {short-project-name} CRDs mentioned in this tutorial and in the rest of documentation have short names, which are easier to use. These are the short names for the CRDs:
es: Las CRD de {short-project-name} mencionadas en este tutorial y en el resto de la documentación tienen nombres cortos, que son más fáciles de usar. Estos son los nombres cortos de las CRD:

source: | Resource | shortName | AdmissionPolicies | *ap* | ClusterAdmissionPolicies | *cap* | AdmissionPolicyGroups | *apg* | ClusterAdmissionPolicyGroups | *capg* | PolicyServers | *ps*
es: | Recurso | nombreCorto | AdmissionPolicies | *ap* | ClusterAdmissionPolicies | *cap* | AdmissionPolicyGroups | *apg* | ClusterAdmissionPolicyGroups | *capg* | PolicyServers | *ps*

source: Installation
es: Instalación

source: Authentication
es: Autenticación

source: You can retrieve {short-project-name} policies from the GitHub container registry at https://ghcr.io. You need authentication to use the repository with the {short-project-name} CLI, a {gh-pat-url}[GitHub personal access token] (PAT). Their documentation guides you through creating one if you haven't already done so. Then you authenticate with a command like:
es: Puede recuperar las políticas de {short-project-name} del registro de contenedores de GitHub en https://ghcr.io. Necesita autenticación para usar el repositorio con la CLI de {short-project-name}, un {gh-pat-url}[token de acceso personal de GitHub] (PAT). Su documentación le guía a través de la creación de uno si aún no lo ha hecho. A continuación, se autentica con un comando como:

source: echo $PAT | docker login ghcr.io --username <my-gh-username> --password-stdin
es: echo $PAT | docker login ghcr.io --username <mi-usuario-gh> --password-stdin

source: Deploy the {short-project-name} stack using `helm` charts as follows:
es: Despliegue la pila de {short-project-name} usando los charts de `helm` de la siguiente manera:

source: Install the following Helm charts in the `kubewarden` namespace in your Kubernetes cluster:
es: Instale los siguientes charts de Helm en el espacio de nombres `kubewarden` de su clúster de Kubernetes:

source: `kubewarden-crds`, which registers the {cluster-admission-policy}, {admission-policy} and {policy-server} Custom Resource Definitions. Also, the {report} Custom Resource Definitions used by the audit scanner.
es: `kubewarden-crds`, que registra las Definiciones de Recursos Personalizados {cluster-admission-policy}, {admission-policy} y {policy-server}. También, las Definiciones de Recursos Personalizados {report} utilizadas por el escáner de auditoría.

source: `kubewarden-controller`, which installs the {short-project-name} controller and the audit scanner
es: `kubewarden-controller`, que instala el controlador de {short-project-name} y el escáner de auditoría

source: If you need to disable the audit scanner component check the audit scanner installation xref:howtos/audit-scanner.adoc[documentation page].
es: Si necesita deshabilitar el componente del escáner de auditoría, consulte la xref:howtos/audit-scanner.adoc[página de documentación] de instalación del escáner de auditoría.

source: `kubewarden-defaults`, which creates a `PolicyServer` resource named `default`. It can also install a set of recommended policies to secure your cluster by enforcing well known best practices.
es: `kubewarden-defaults`, que crea un recurso `PolicyServer` llamado `default`. También puede instalar un conjunto de políticas recomendadas para proteger su clúster mediante la aplicación de buenas prácticas conocidas.

source: Since https://github.com/kubewarden/kubewarden-controller/releases/tag/v0.4.0[`v0.4.0`], a `PolicyServer` resource named `default` isn't created using the `kubewarden-controller` chart. Now a Helm chart called `kubewarden-defaults`, installs the default policy server.
es: Desde https://github.com/kubewarden/kubewarden-controller/releases/tag/v0.4.0[`v0.4.0`], no se crea un recurso `PolicyServer` llamado `default` usando el chart `kubewarden-controller`. Ahora un chart de Helm llamado `kubewarden-defaults`, instala el servidor de políticas predeterminado.

source: This means that if not using the latest version of the `kubewarden-controller` while upgrading or deleting, your default policy server isn't upgraded or deleted. So, you might run into issues if you try to install the `kubewarden-defaults` with conflicting information, for example, the same policy server name. To install future upgrades of the `kubewarden-defaults` Helm chart remove the existing `PolicyServer` resource created by the `kubewarden-controller` before installing the new chart. Now you can update your policy server using Helm upgrades without resource conflicts. When you remove the `PolicyServer`, you remove all the policies bound to it as well.
es: Esto significa que si no se utiliza la última versión del `kubewarden-controller` al actualizar o eliminar, su servidor de políticas predeterminado no se actualiza ni se elimina. Por lo tanto, podría tener problemas si intenta instalar `kubewarden-defaults` con información contradictoria, por ejemplo, el mismo nombre de servidor de políticas. Para instalar futuras actualizaciones del chart de Helm `kubewarden-defaults`, elimine el recurso `PolicyServer` existente creado por el `kubewarden-controller` antes de instalar el nuevo chart. Ahora puede actualizar su servidor de políticas utilizando las actualizaciones de Helm sin conflictos de recursos. Cuando elimina el `PolicyServer`, también elimina todas las políticas vinculadas a él.

source: The default configuration values are sufficient for most deployments. The https://charts.kubewarden.io/#configuration[documentation] describes all the options.
es: Los valores de configuración predeterminados son suficientes para la mayoría de los despliegues. La https://charts.kubewarden.io/#configuration[documentación] describe todas las opciones.

source: Main components
es: Componentes principales

source: {short-project-name} has three main components which you interact with:
es: {short-project-name} tiene tres componentes principales con los que interactúa:

source: The {policy-server}
es: El {policy-server}

source: The {cluster-admission-policy}
es: El {cluster-admission-policy}

source: The {admission-policy}
es: El {admission-policy}

source: The `kubewarden-controller` manages a {short-project-name} `PolicyServer`. You can deploy multiple {policy-server}s in the same Kubernetes cluster.
es: El `kubewarden-controller` gestiona un `PolicyServer` de {short-project-name}. Puede desplegar múltiples {policy-server}s en el mismo clúster de Kubernetes.

source: A `PolicyServer` validates incoming requests by executing {short-project-name} policies against them.
es: Un `PolicyServer` valida las solicitudes entrantes ejecutando políticas de {short-project-name} contra ellas.

source: This is the default `PolicyServer` configuration:
es: Esta es la configuración predeterminada de `PolicyServer`:

source: Check the https://github.com/kubewarden/policy-server/pkgs/container/policy-server[latest released `PolicyServer` version] and change the tag to match.
es: Compruebe la https://github.com/kubewarden/policy-server/pkgs/container/policy-server[última versión publicada de `PolicyServer`] y cambie la etiqueta para que coincida.

source: Overview of the attributes of the `PolicyServer` resource:
es: Resumen de los atributos del recurso `PolicyServer`:

source: | Required | Placeholder | Description | Y | `image` | The name of the container image | Y | `replicas` | The number of desired instances | N | `serviceAccountName` | The name of the `ServiceAccount` to use for the `PolicyServer` deployment. If there is no provided value, the default `ServiceAccount` from the installation namespace, of `kubewarden-controller`, gets used. | N | `env` | The list of environment variables | N | `annotations` | The list of annotations
es: | Requerido | Marcador de posición | Descripción | Y | `image` | El nombre de la imagen del contenedor | Y | `replicas` | El número de instancias deseadas | N | `serviceAccountName` | El nombre de la `ServiceAccount` a utilizar para el despliegue del `PolicyServer`. Si no se proporciona ningún valor, se utiliza la `ServiceAccount` predeterminada del espacio de nombres de instalación de `kubewarden-controller`. | N | `env` | La lista de variables de entorno | N | `annotations` | La lista de anotaciones

source: Changing any of these attributes causes a `PolicyServer` deployment with the new configuration.
es: Cambiar cualquiera de estos atributos provoca un despliegue de `PolicyServer` con la nueva configuración.

source: The {cluster-admission-policy} resource is the core of the {short-project-name} stack. It defines how policies evaluate requests.
es: El recurso {cluster-admission-policy} es el núcleo de la pila de {short-project-name}. Define cómo las políticas evalúan las solicitudes.

source: Enforcing policies is the most common operation which a Kubernetes administrator performs. You can declare as many policies as you want, each targets one or more Kubernetes resources (that is, `pods`, `Custom Resource` and others). You also specify the type of operations applied to targeted resources. The operations available are `CREATE`, `UPDATE`, `DELETE` and `CONNECT`.
es: La aplicación de políticas es la operación más común que realiza un administrador de Kubernetes. Puede declarar tantas políticas como desee, cada una dirigida a uno o más recursos de Kubernetes (es decir, `pods`, `Recursos Personalizados` y otros). También especifica el tipo de operaciones aplicadas a los recursos de destino. Las operaciones disponibles son `CREATE`, `UPDATE`, `DELETE` y `CONNECT`.

source: Default {cluster-admission-policy} configuration:
es: Configuración predeterminada de {cluster-admission-policy}:

source: Overview of the attributes of the {cluster-admission-policy} resource:
es: Resumen de los atributos del recurso {cluster-admission-policy}:

source: | Required | Placeholder | Description | N | `policy-server` | Identifies an existing `PolicyServer` object. Only this `PolicyServer` instance serves the policy. The policy server named `default` serves a {cluster-admission-policy} without an explicit `PolicyServer`. | Y | `module` | The location of the {short-project-name} policy. The following schemes are allowed: | N | | - `registry`: Policy download from an https://github.com/opencontainers/artifacts[OCI artifacts] compliant container registry. Example: `registry://<OCI registry/policy URL>` | N | | - `http`, `https`: Policy download from a regular HTTP(s) server. Example: `\https://<website/policy URL>` | N | | - `file`: Load the policy from a file in the computer file system. Example: `\file:///<policy WASM binary full path>` | Y | `resources` | The Kubernetes resources evaluated by the policy | Y | `operations` | What operations for the previously given types should be forwarded to this admission policy by the API server for evaluation. | Y | `mutating` | Set this boolean value `true` for policies that can mutate incoming requests | N | `settings` | A free-form object that contains the policy configuration values | N | `failurePolicy` | The action to take if the request evaluated by a policy results in an error. The following options are allowed: | N | | - `Ignore`: ignore an error calling the webhook and the API request continues. | N | | - `Fail`: an error calling the webhook causes the admission to fail and API request rejection.
es: | Requerido | Marcador de posición | Descripción | N | `policy-server` | Identifica un objeto `PolicyServer` existente. Solo esta instancia de `PolicyServer` sirve la política. El servidor de políticas llamado `default` sirve un {cluster-admission-policy} sin un `PolicyServer` explícito. | Y | `module` | La ubicación de la política de {short-project-name}. Se permiten los siguientes esquemas: | N | | - `registry`: Descarga de políticas desde un registro de contenedores compatible con https://github.com/opencontainers/artifacts[artefactos OCI]. Ejemplo: `registry://<URL del registro/política OCI>` | N | | - `http`, `https`: Descarga de políticas desde un servidor HTTP(s) regular. Ejemplo: `\https://<URL del sitio web/política>` | N | | - `file`: Carga la política desde un archivo en el sistema de archivos del ordenador. Ejemplo: `\file:///<ruta completa del binario WASM de la política>` | Y | `resources` | Los recursos de Kubernetes evaluados por la política | Y | `operations` | Qué operaciones para los tipos dados anteriormente deben ser reenviadas a esta política de admisión por el servidor de la API para su evaluación. | Y | `mutating` | Establezca este valor booleano en `true` para las políticas que pueden mutar las solicitudes entrantes | N | `settings` | Un objeto de formato libre que contiene los valores de configuración de la política | N | `failurePolicy` | La acción a tomar si la solicitud evaluada por una política resulta en un error. Se permiten las siguientes opciones: | N | | - `Ignore`: ignora un error al llamar al webhook y la solicitud de la API continúa. | N | | - `Fail`: un error al llamar al webhook hace que la admisión falle y se rechace la solicitud de la API.

source: The controller registers the {cluster-admission-policy} resources `*` webhook `scope`. This means that registered webhooks forward all requests matching the given `resources` and `operations`, either namespaced or cluster-wide resources.
es: El controlador registra el `scope` del webhook `*` de los recursos {cluster-admission-policy}. Esto significa que los webhooks registrados reenvían todas las solicitudes que coinciden con los `resources` y `operations` dados, ya sean recursos con espacio de nombres o de todo el clúster.
