Repository: jhkrug/kubewarden-product-docs
Catalog: po/*.po
Languages: es

source: {admission-policy} is a namespace-wide resource. The policy processes only the requests that are targeting the Namespace with the {admission-policy} defined. Other than that, there are no functional differences between the {admission-policy} and {cluster-admission-policy} resources.
es: {admission-policy} es un recurso de todo el espacio de nombres. La política procesa solo las solicitudes que se dirigen al espacio de nombres con el {admission-policy} definido. Aparte de eso, no hay diferencias funcionales entre los recursos {admission-policy} y {cluster-admission-policy}.

source: {admission-policy} requires Kubernetes 1.21.0 or greater. This is because {short-project-name} uses the `kubernetes.io/metadata.name` label, introduced in Kubernetes 1.21.0
es: {admission-policy} requiere Kubernetes 1.21.0 o superior. Esto se debe a que {short-project-name} utiliza la etiqueta `kubernetes.io/metadata.name`, introducida en Kubernetes 1.21.0

source: The complete documentation of these Custom Resources is https://github.com/kubewarden/kubewarden-controller/blob/main/docs/crds/README.asciidoc[here] or on https://doc.crds.dev/github.com/kubewarden/kubewarden-controller[docs.crds.dev].
es: La documentación completa de estos Recursos Personalizados está https://github.com/kubewarden/kubewarden-controller/blob/main/docs/crds/README.asciidoc[aquí] o en https://doc.crds.dev/github.com/kubewarden/kubewarden-controller[docs.crds.dev].

source: Example: Enforce your first policy
es: Ejemplo: Aplicar su primera política

source: We will use the https://github.com/kubewarden/pod-privileged-policy[`pod-privileged`] policy. We want to prevent the creation of privileged containers inside our Kubernetes cluster by enforcing this policy.
es: Usaremos la política https://github.com/kubewarden/pod-privileged-policy[`pod-privileged`]. Queremos evitar la creación de contenedores privilegiados dentro de nuestro clúster de Kubernetes aplicando esta política.

source: Let's define a {cluster-admission-policy} to do that:
es: Definamos un {cluster-admission-policy} para hacer eso:

source: This produces the following output:
es: Esto produce la siguiente salida:

source: After instantiating a {cluster-admission-policy}, the status becomes `pending`, and it forces a rollout of the targeted `PolicyServer`. In the example, it's the `PolicyServer` named `default`. You can monitor the rollout by running the following command:
es: Después de instanciar un {cluster-admission-policy}, el estado se vuelve `pending`, y fuerza un despliegue del `PolicyServer` de destino. En el ejemplo, es el `PolicyServer` llamado `default`. Puede supervisar el despliegue ejecutando el siguiente comando:

source: You should see the following output:
es: Debería ver la siguiente salida:

source: Once the new policy is ready, the `kubewarden-controller` registers a https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.33/#validatingwebhookconfiguration-v1-admissionregistration-k8s-io[ValidatingWebhookConfiguration] object to serve it.
es: Una vez que la nueva política está lista, el `kubewarden-controller` registra un objeto https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.33/#validatingwebhookconfiguration-v1-admissionregistration-k8s-io[ValidatingWebhookConfiguration] para servirla.

source: The {cluster-admission-policy} status becomes `active` once the Deployment completes for every `PolicyServer` instance. Show {validating-webhook-configuration}s with the following command:
es: El estado de {cluster-admission-policy} se vuelve `active` una vez que el Despliegue se completa para cada instancia de `PolicyServer`. Muestre los {validating-webhook-configuration}s con el siguiente comando:

source: Once the {cluster-admission-policy} is active and the {validating-webhook-configuration} registers, you can test the policy.
es: Una vez que el {cluster-admission-policy} está activo y el {validating-webhook-configuration} se registra, puede probar la política.

source: First, you can create a Pod with a Container _not_ in `privileged` mode:
es: Primero, puede crear un Pod con un Contenedor _no_ en modo `privileged`:

source: The Pod is successfully created.
es: El Pod se crea con éxito.

source: Now, you can create a Pod with at least one Container `privileged` flag:
es: Ahora, puede crear un Pod con al menos una bandera `privileged` de Contenedor:

source: The policy denies creation of the Pod and you should see the following message:
es: La política deniega la creación del Pod y debería ver el siguiente mensaje:

source: Both examples didn't define a `namespace`, which means the `default` namespace was the target. However, as you could see in the second example, the policy is still applied. As stated previously, this is due to the scope being cluster-wide and not targeting a specific namespace.
es: Ambos ejemplos no definieron un `namespace`, lo que significa que el `namespace` `default` era el objetivo. Sin embargo, como pudo ver en el segundo ejemplo, la política todavía se aplica. Como se indicó anteriormente, esto se debe a que el alcance es de todo el clúster y no se dirige a un espacio de nombres específico.

source: Uninstall
es: Desinstalar

source: You can remove the resources created by uninstalling the `helm` charts as follows:
es: Puede eliminar los recursos creados desinstalando los charts de `helm` de la siguiente manera:

source: After removal of the `helm` charts remove the Kubernetes namespace used to deploy the {short-project-name} stack:
es: Después de eliminar los charts de `helm`, elimine el espacio de nombres de Kubernetes utilizado para desplegar la pila de {short-project-name}:

source: {short-project-name} contains a helm pre-delete hook that removes all `PolicyServer`s and `kubewarden-controller`s. Then the `kubewarden-controller` deletes all resources, so it's important that `kubewarden-controller` is running when helm uninstall executes.
es: {short-project-name} contiene un gancho de pre-eliminación de helm que elimina todos los `PolicyServer`s y `kubewarden-controller`s. Luego, el `kubewarden-controller` elimina todos los recursos, por lo que es importante que `kubewarden-controller` se esté ejecutando cuando se ejecute la desinstalación de helm.

source: {short-project-name} deletes {validating-webhook-configuration}s and {mutating-webhook-configuration}s. Check this with:
es: {short-project-name} elimina los {validating-webhook-configuration}s y {mutating-webhook-configuration}s. Compruébelo con:

source: If these resources aren't automatically removed, remove them manually using the following command:
es: Si estos recursos no se eliminan automáticamente, elimínelos manualmente con el siguiente comando:

source: Wrapping up
es: Conclusión

source: {cluster-admission-policy} is the core resource that a cluster operator has to manage. The `kubewarden-controller` module automatically takes care of the configuration for the rest of the resources needed to run the policies.
es: {cluster-admission-policy} es el recurso principal que un operador de clúster tiene que gestionar. El módulo `kubewarden-controller` se encarga automáticamente de la configuración del resto de los recursos necesarios para ejecutar las políticas.

source: What's next?
es: ¿Qué sigue?

source: Now, you are ready to deploy {short-project-name}! Have a look at the policies on https://artifacthub.io/packages/search?kind=13[artifacthub.io], on https://github.com/topics/kubewarden-policy[GitHub], or reuse existing Rego policies as shown in the xref:tutorials/writing-policies/rego/01-intro-rego.adoc[following chapters].
es: ¡Ahora está listo para desplegar {short-project-name}! Eche un vistazo a las políticas en https://artifacthub.io/packages/search?kind=13[artifacthub.io], en https://github.com/topics/kubewarden-policy[GitHub], o reutilice las políticas de Rego existentes como se muestra en los xref:tutorials/writing-policies/rego/01-intro-rego.adoc[siguientes capítulos].

source: Full list of available policies on ArtifactHub
es: Lista completa de políticas disponibles en ArtifactHub

source: Documentation organization
es: Organización de la documentación

source: {project-name} organizes project documentation as follows:
es: {project-name} organiza la documentación del proyecto de la siguiente manera:

source: xref:/introduction.adoc[Introduction]
es: xref:/introduction.adoc[Introducción]

source: xref:/quick-start.adoc[Quick start]
es: xref:/quick-start.adoc[Inicio rápido]

source: _Tutorials_—learning through examples.
es: _Tutoriales_—aprendizaje a través de ejemplos.

source: _Explanations_—underlying concepts.
es: _Explicaciones_—conceptos subyacentes.

source: _How-tos_—getting {short-project-name} tasks done.
es: _Guías prácticas_—realización de tareas de {short-project-name}.

source: _Reference_
es: _Referencia_

source: Organization—this page
es: Organización—esta página

source: xref:/personas.adoc[Personas]—who is {short-project-name} for?
es: xref:/personas.adoc[Personas]—¿para quién es {short-project-name}?

source: xref:/disclosure.adoc[Security]
es: xref:/disclosure.adoc[Seguridad]

source: xref:/glossary.adoc[Glossary]
es: xref:/glossary.adoc[Glosario]

source: Most of the material is in the four sections, _Tutorials_, _Explanations_, _How-tos_, and _Reference_. There may be overlap as the sections are not mutually exclusive. The {short-project-name} project tries to follow the link:https://diataxis.fr/[Diátaxis] documentation framework.
es: La mayor parte del material se encuentra en las cuatro secciones, _Tutoriales_, _Explicaciones_, _Guías prácticas_ y _Referencia_. Puede haber superposición, ya que las secciones no son mutuamente excluyentes. El proyecto {short-project-name} intenta seguir el marco de documentación link:https://diataxis.fr/[Diátaxis].

source: Navigation
es: Navegación

source: The left hand contents menu always indicates your current document location. The right hand sections menu shows the current page sections. There is also a 'breadcrumbs' feature at the top of the main content panel on each page.
es: El menú de contenidos de la izquierda siempre indica la ubicación actual de su documento. El menú de secciones de la derecha muestra las secciones de la página actual. También hay una función de 'migas de pan' en la parte superior del panel de contenido principal de cada página.

source: Search
es: Búsqueda

source: A search box facility is in the header panel of each page.
es: En el panel de cabecera de cada página hay un cuadro de búsqueda.

source: Editing
es: Edición

source: A link to the page source on GitHub is at the bottom of each page.
es: En la parte inferior de cada página hay un enlace al código fuente de la página en GitHub.

source: Other resources
es: Otros recursos

source: Also maintained are:
es: También se mantienen:

source: link:https://github.com/kubewarden/rfc[RFCs] for the project.
es: link:https://github.com/kubewarden/rfc[RFCs] para el proyecto.

source: A series of link:https://www.kubewarden.io/blog/[blog posts] related to {community-name} releases.
es: Una serie de link:https://www.kubewarden.io/blog/[entradas de blog] relacionadas con los lanzamientos de {community-name}.

source: Items related to the link:https://github.com/kubewarden/community[community] management of {community-name}.
es: Elementos relacionados con la link:https://github.com/kubewarden/community[gestión de la comunidad] de {community-name}.

source: Security disclosure
es: Divulgación de seguridad

source: | Organization | Offering | link:https://suse.com[SUSE] | SUSE provides complete {project-name} enterprise support with link:https://www.suse.com/products/rancher[SUSE® Rancher Prime].
es: | Organización | Oferta | link:https://suse.com[SUSE] | SUSE proporciona soporte empresarial completo para {project-name} con link:https://www.suse.com/products/rancher[SUSE® Rancher Prime].

source: Glossary
es: Glosario

source: A namespace-wide resource. The policy processes only those requests targeting the namespace in which the AdmissionPolicy is defined.
es: Un recurso de todo el espacio de nombres. La política procesa solo aquellas solicitudes dirigidas al espacio de nombres en el que se define la AdmissionPolicy.

source: An <<_admissionpolicy,AdmissionPolicy>> which targets cluster-wide resources.
es: Una <<_admissionpolicy,AdmissionPolicy>> que se dirige a recursos de todo el clúster.

source: A <<_report,Report>> and a ClusterReport store results of policy scans. Which one is used, depends on the scope of the resource.
es: Un <<_report,Report>> y un ClusterReport almacenan los resultados de los escaneos de políticas. Cuál se utiliza depende del alcance del recurso.

source: A CLI tool to generate and test Kubernetes YAML files for policy deployment.
es: Una herramienta CLI para generar y probar archivos YAML de Kubernetes para el despliegue de políticas.

source: A https://kubernetes.io/docs/reference/access-authn-authz/extensible-admission-controllers/#what-are-admission-webhooks[Kubernetes resource] created by the {short-project-name} controller to let Kubernetes know where to send an `AdmissionReview`. In other words, this is how a {short-project-name} controller informs Kubernetes where to find a resource mutating policy.
es: Un https://kubernetes.io/docs/reference/access-authn-authz/extensible-admission-controllers/#what-are-admission-webhooks[recurso de Kubernetes] creado por el controlador de {short-project-name} para que Kubernetes sepa dónde enviar una `AdmissionReview`. En otras palabras, así es como un controlador de {short-project-name} informa a Kubernetes dónde encontrar una política de mutación de recursos.

source: A Report and a <<_clusterreport,ClusterReport>> store results of policy scans. Which one is used depends on the scope of the resource.
es: Un Report y un <<_clusterreport,ClusterReport>> almacenan los resultados de los escaneos de políticas. Cuál se utiliza depende del alcance del recurso.

source: A PolicyServer validates incoming requests by executing {short-project-name} policies against requests.
es: Un PolicyServer valida las solicitudes entrantes ejecutando políticas de {short-project-name} contra las solicitudes.

source: A https://kubernetes.io/docs/reference/access-authn-authz/extensible-admission-controllers/#what-are-admission-webhooks[Kubernetes resource] created by the {short-project-name} controller to let Kubernetes know where to send a `AdmissionReview`. In other words, this is how {short-project-name} informs Kubernetes where to find a resource validating policy.
es: Un https://kubernetes.io/docs/reference/access-authn-authz/extensible-admission-controllers/#what-are-admission-webhooks[recurso de Kubernetes] creado por el controlador de {short-project-name} para que Kubernetes sepa dónde enviar una `AdmissionReview`. En otras palabras, así es como {short-project-name} informa a Kubernetes dónde encontrar una política de validación de recursos.

source: WebAssembly Procedure Calls. https://wapc.io.
es: Llamadas a Procedimientos de WebAssembly. https://wapc.io.

source: WebAssembly System Interface. https://wasi.dev.
es: Interfaz del Sistema WebAssembly. https://wasi.dev.

source: A binary instruction format for a stack-based virtual machine. Designed for web deployment. https://webassembly.org.
es: Un formato de instrucción binario para una máquina virtual basada en pila. Diseñado para el despliegue en la web. https://webassembly.org.

source: A runtime for WebAssembly. https://wasmtime.dev.
es: Un tiempo de ejecución para WebAssembly. https://wasmtime.dev.

source: Who is this project for? The personas.
es: ¿Para quién es este proyecto? Las personas.

source: ## {project-name} personas
es: ## Personas de {project-name}

source: |Persona |Description |**Policy user** |Someone who takes a policy and uses it in a cluster. They deploy policies and observe results. They configure the policy settings but do not write the policy internal code (if there is any). |**Operator** |Someone operating {short-project-name} in a cluster. Installs and maintains {short-project-name}. |**Policy distributor** |Someone who has written a policy and wants to share it with others. They want the policy consumed by the “policy user” role. A distributor of {short-project-name} policies, to places such as ArtifactHub or private OCI repositories. |**Policy developer** |A person designing and writing policies for {short-project-name} for others to consume. |**Integrator** |Builds with, using, or on top of {short-project-name}. Perhaps a custom UI or a helper tool for generating policies. |**Developer** |A person working on the {short-project-name} product set. Building {short-project-name} itself.
es: |Persona |Descripción |**Usuario de políticas** |Alguien que toma una política y la usa en un clúster. Despliegan políticas y observan los resultados. Configuran los ajustes de la política pero no escriben el código interno de la política (si lo hay). |**Operador** |Alguien que opera {short-project-name} en un clúster. Instala y mantiene {short-project-name}. |**Distribuidor de políticas** |Alguien que ha escrito una política y quiere compartirla con otros. Quieren que la política sea consumida por el rol de "usuario de políticas". Un distribuidor de políticas de {short-project-name}, a lugares como ArtifactHub o repositorios OCI privados. |**Desarrollador de políticas** |Una persona que diseña y escribe políticas para {short-project-name} para que otros las consuman. |**Integrador** |Construye con, usando o sobre {short-project-name}. Quizás una interfaz de usuario personalizada o una herramienta de ayuda para generar políticas. |**Desarrollador** |Una persona que trabaja en el conjunto de productos de {short-project-name}. Construyendo {short-project-name} en sí.

source: {project-name} use cases
es: Casos de uso de {project-name}

source: These are a few example use cases for {project-name}'s xref:/personas.adoc[personas].
es: Estos son algunos ejemplos de casos de uso para las xref:/personas.adoc[personas] de {project-name}.

source: Case A: As a Kubernetes operator, I want to ensure my cluster is safe and compliant.
es: Caso A: Como operador de Kubernetes, quiero asegurarme de que mi clúster sea seguro y cumpla con las normativas.

source: I deploy {project-name} and its default configuration with its `kubewarden-defaults` Helm chart, in the `kubewarden` Namespace. This deploys a default PolicyServer and recommended ClusterAdmissionPolicies in the `kubewarden` namespace, solely under the control of the Kubernetes operator.
es: Despliego {project-name} y su configuración predeterminada con su chart de Helm `kubewarden-defaults`, en el espacio de nombres `kubewarden`. Esto despliega un PolicyServer predeterminado y ClusterAdmissionPolicies recomendadas en el espacio de nombres `kubewarden`, únicamente bajo el control del operador de Kubernetes.

source: As an operator, I can add more PolicyServers under a managed Namespace (such as `kubewarden`) to distribute load and fault tolerance.
es: Como operador, puedo agregar más PolicyServers bajo un espacio de nombres gestionado (como `kubewarden`) para distribuir la carga y la tolerancia a fallos.

source: Operators can deploy more ClusterAdmissionPolicies and ClusterAdmissionPolicyGroups. These check all the Kubernetes resources, for any type of operation (GET, CREATE, UPDATE, PATCH, DELETE, PROXY). This ensures operations into the cluster are safe and compliant.
es: Los operadores pueden desplegar más ClusterAdmissionPolicies y ClusterAdmissionPolicyGroups. Estos comprueban todos los recursos de Kubernetes, para cualquier tipo de operación (GET, CREATE, UPDATE, PATCH, DELETE, PROXY). Esto garantiza que las operaciones en el clúster sean seguras y cumplan con las normativas.

source: These include:
es: Estos incluyen:

source: security
es: seguridad

source: compliance (to industry standards or company regulations)
es: cumplimiento (de normas del sector o reglamentos de la empresa)

source: resource optimization (via mutating policies)
es: optimización de recursos (a través de políticas de mutación)

source: governance of Kubernetes environments (via labels and naming conventions)
es: gobernanza de los entornos de Kubernetes (a través de etiquetas y convenciones de nomenclatura)

source: best practices
es: mejores prácticas

source: image verification
es: verificación de imágenes

source: Security expectations change over time. Previously correct deployments in the cluster may no longer be so. Yet {short-project-name} has already accepted those operations in the cluster. In these situations, the operator can deploy the Audit Scanner feature, a CronJob that runs periodically and evaluates the existing resources in the cluster. This checks the cluster is safe and compliant even over time.
es: Las expectativas de seguridad cambian con el tiempo. Los despliegues previamente correctos en el clúster pueden dejar de serlo. Sin embargo, {short-project-name} ya ha aceptado esas operaciones en el clúster. En estas situaciones, el operador puede desplegar la función de Escáner de Auditoría, un CronJob que se ejecuta periódicamente y evalúa los recursos existentes en el clúster. Esto comprueba que el clúster es seguro y cumple con las normativas incluso con el paso del tiempo.

source: The operator can configure policies in `monitor` mode instead of `protect` mode, to learn from the state of the cluster without blocking operations.
es: El operador puede configurar las políticas en modo `monitor` en lugar de en modo `protect`, para aprender del estado del clúster sin bloquear las operaciones.

source: Operators can receive information from policies and the {short-project-name} stack by consuming logs and OpenTelemetry information for metrics and tracing.
es: Los operadores pueden recibir información de las políticas y de la pila de {short-project-name} consumiendo registros e información de OpenTelemetry para métricas y trazabilidad.

source: Case B: As a Kubernetes operator, I want to provide a framework to my Kubernetes users so they can self-service in their Namespaces.
es: Caso B: Como operador de Kubernetes, quiero proporcionar un marco a mis usuarios de Kubernetes para que puedan autogestionarse en sus espacios de nombres.

source: As an operator, I deploy {short-project-name} as in Case A for a set of policies of my choosing. This provides me with a safe baseline in the cluster, that other users can't evade.
es: Como operador, despliego {short-project-name} como en el Caso A para un conjunto de políticas de mi elección. Esto me proporciona una base segura en el clúster, que otros usuarios no pueden eludir.

source: As well as Case A, I have different personas per Namespaces: perhaps teams, team administrators, test deployments, and others. I allow each Namespace administrator to self-service by letting them deploy PolicyServers in their Namespace, along with namespaced AdmissionPolicies and AdmissionPolicyGroups. This architecture means that they're in control of their PolicyServer and policies. The policies only apply to their Namespace, and they constrain resource usage to their Namespace.
es: Además del Caso A, tengo diferentes personas por espacio de nombres: quizás equipos, administradores de equipos, despliegues de prueba y otros. Permito que cada administrador de espacio de nombres se autogestione permitiéndoles desplegar PolicyServers en su espacio de nombres, junto con AdmissionPolicies y AdmissionPolicyGroups con espacio de nombres. Esta arquitectura significa que tienen el control de su PolicyServer y sus políticas. Las políticas solo se aplican a su espacio de nombres, y restringen el uso de recursos a su espacio de nombres.
