Repository: jhkrug/kubewarden-product-docs
Catalog: po/*.po
Languages: es

source: It also permits the operator to segregate noisy tenants, reserving performant PolicyServers for those tenants and tasks that need high throughput and low latency, for example.
es: También permite al operador segregar a los inquilinos ruidosos, reservando PolicyServers de alto rendimiento para aquellos inquilinos y tareas que necesitan un alto rendimiento y baja latencia, por ejemplo.

source: Case C: As a policy author, I want to use the tools and languages that I know to write new policies.
es: Caso C: Como autor de políticas, quiero usar las herramientas y los lenguajes que conozco para escribir nuevas políticas.

source: {short-project-name} achieves this by supporting any language that compiles to WebAssembly as possible target languages for policies. This means that policy authors can reuse their workflows (`git`, CI, editors, peer reviews, etc.), and tools: languages, language libraries, testing harnesses and frameworks, etc.
es: {short-project-name} lo consigue soportando cualquier lenguaje que compile a WebAssembly como posibles lenguajes de destino para las políticas. Esto significa que los autores de políticas pueden reutilizar sus flujos de trabajo (`git`, CI, editores, revisiones por pares, etc.), y herramientas: lenguajes, bibliotecas de lenguajes, arneses y marcos de pruebas, etc.

source: It permits re-using Domain Specific Languages (like Rego, CEL, Kyverno's YAML+macros) or general-purpose languages (like Go, Rust, C#, Javascript, any that compiles to Wasm). {short-project-name} provides xref:/tutorials/writing-policies/index.adoc[SDKs] for a few languages as first-class support.
es: Permite reutilizar Lenguajes Específicos de Dominio (como Rego, CEL, YAML+macros de Kyverno) o lenguajes de propósito general (como Go, Rust, C#, Javascript, cualquiera que compile a Wasm). {short-project-name} proporciona xref:/tutorials/writing-policies/index.adoc[SDKs] para algunos lenguajes como soporte de primera clase.

source: {short-project-name} policies can be simple or complex xref:/explanations/context-aware-policies.adoc[context-aware] policies. Context-aware policies are also used to interface with separate workloads (for example, to obtain information from an image scanner long-running service).
es: Las políticas de {short-project-name} pueden ser políticas simples o complejas xref:/explanations/context-aware-policies.adoc[conscientes del contexto]. Las políticas conscientes del contexto también se utilizan para interactuar con cargas de trabajo separadas (por ejemplo, para obtener información de un servicio de larga duración de un escáner de imágenes).

source: Case D: As a system integrator, I want to re-use {short-project-name} as part of my security and compliance solution.
es: Caso D: Como integrador de sistemas, quiero reutilizar {short-project-name} como parte de mi solución de seguridad y cumplimiento.

source: As a system integrator, I want to re-use {short-project-name}, and possibly re-use other solutions by including them in {short-project-name}.
es: Como integrador de sistemas, quiero reutilizar {short-project-name}, y posiblemente reutilizar otras soluciones incluyéndolas en {short-project-name}.

source: As a system integrator, I can reuse parts of {short-project-name}. For example, the `policy-server`, to police resources, internal or external to the Kubernetes cluster via the xref:/howtos/raw-policies.adoc["raw policies"] feature.
es: Como integrador de sistemas, puedo reutilizar partes de {short-project-name}. Por ejemplo, el `policy-server`, para vigilar los recursos, internos o externos al clúster de Kubernetes a través de la función de xref:/howtos/raw-policies.adoc["políticas sin procesar"].

source: System integrators can choose to deploy the `kubewarden-controller` or manage the CRDs on their own. They can choose to deploy or scale the Audit Scanner as needed.
es: Los integradores de sistemas pueden optar por desplegar el `kubewarden-controller` o gestionar las CRD por su cuenta. Pueden optar por desplegar o escalar el Escáner de Auditoría según sea necesario.

source: System integrators can create new components. For example, an image scanner, and interface with it via a context-aware policy, without having a monolithic implementation in a Kubernetes controller.
es: Los integradores de sistemas pueden crear nuevos componentes. Por ejemplo, un escáner de imágenes, e interactuar con él a través de una política consciente del contexto, sin tener una implementación monolítica en un controlador de Kubernetes.

source: Non-goals
es: No objetivos

source: {short-project-name} doesn't intend to:
es: {short-project-name} no pretende:

source: Replace Kubernetes built-in security features, but complement them:
es: Sustituir las funciones de seguridad integradas de Kubernetes, sino complementarlas:

source: {short-project-name} provides migration from PSPs.
es: {short-project-name} proporciona migración desde PSPs.

source: You can re-use ValidatingAdmissionPolicies and CEL policies with {short-project-name}'s `cel-policy`.
es: Puede reutilizar ValidatingAdmissionPolicies y políticas CEL con la `cel-policy` de {short-project-name}.

source: {short-project-name} policies can be mutating, while Pod Security Admission cannot.
es: Las políticas de {short-project-name} pueden ser mutantes, mientras que la Admisión de Seguridad de Pods no puede.

source: {short-project-name} policies benefit from the {short-project-name} stack features (audit scanner, telemetry, CRD management).
es: Las políticas de {short-project-name} se benefician de las características de la pila de {short-project-name} (escáner de auditoría, telemetría, gestión de CRD).

source: Provide runtime security like intrusion detection or runtime container isolation.
es: Proporcionar seguridad en tiempo de ejecución como detección de intrusiones o aislamiento de contenedores en tiempo de ejecución.

source: Provide host system protection of clusters.
es: Proporcionar protección del sistema anfitrión de los clústeres.

source: Provide infinite policy execution flexibility. To prevent DoS attacks, policies' processing times are limited.
es: Proporcionar una flexibilidad de ejecución de políticas infinita. Para evitar ataques DoS, los tiempos de procesamiento de las políticas son limitados.
